Tekla Open API Reference for Tekla Structures 2025
ProfileItemParameter.ParameterUnitType Property
 Defines the parameter unit type.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProfileItemParameter.ParameterUnitTypeEnum ParameterUnitType { get; }
Public ReadOnly Property ParameterUnitType As ProfileItemParameter.ParameterUnitTypeEnum
	Get
Property Value
Type: ProfileItemParameter.ParameterUnitTypeEnum
See Also
Reference
ProfileItemParameter Class
Tekla.Structures.Catalogs Namespace